controllers/MahasiswaController.php

    public function actionCreate()
    {
        $model = new Mahasiswa();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `mahasiswa` (`nim`, `nama`, `jekel`, `tgllahir`, `id_prodi`, `email`, `alamat`) VALUES ('10005', 'Philia', 'P', '2001-03-22', 3, 'philia@gmail.com', 'Testtttttt')

    protected function findModel($id)
    {
        if (($model = Mahasiswa::findOne($id)) !== null) {
---
SELECT * FROM `mahasiswa` WHERE `id`='1'