controllers/MahasiswaController.php

SELECT * FROM `mahasiswa` WHERE `id`='10'
---
    protected function findModel($id)
    {
        if (($model = Mahasiswa::findOne($id)) !== null) {