views/mahasiswa/_form.php

SELECT * FROM `prodi`
---
        ]
    ]); ?>

    <?= $form->field($model, 'id_prodi')->dropDownList(
			ArrayHelper::map(Prodi::find()->all(),'id','prodi'))->label('Prodi') ?>