models/Jurusan.php

SELECT `NamaJurusan`, `jurusan`.`id` FROM `jurusan`
---
    public static function getJurusan()
    {
        return Self::find()->select(['NamaJurusan', 'id'])->indexBy('id')->column();