models/Prodi.php

	public static function getProdiList($cat_id, $dependent = false)
	{
		$subCategory = self::find()
			->where(['id_jurusan' => $cat_id]);

		// return $subCategory;
		// $subCategory = self::find()
		// 	->where(['category_id' => $categoryID]);

		if ($cat_id == "") {
			return $subCategory->select(['id', 'prodi as name'])->asArray()->all();
		} else {
			return $subCategory->select(['prodi'])->indexBy('id')->column();
---
SELECT `prodi` AS `name`, `id` FROM `prodi` WHERE `id_jurusan` IS NULL
SELECT `prodi`, `prodi`.`id` FROM `prodi` WHERE `id_jurusan`=1